<a href="https://colab.research.google.com/github/ImSumitJadhav/EDA-and-analysis-projects/blob/main/Analysis_of_London_Housing_Dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Working on Real Project with Python on 'London Housing Dataset'

----

# LONDON HOUSING DATASET

-----

This dataset is primarily centered around the housing market of London. It contains a lot of additional relevant data:

* Monthly average house prices
* Yearly number of houses sold
* Monthly number of crimes committed

The data used here is from year 1995 to 2019 of each different area.

This data is available as a CSV file, downloaded from Kaggle.

We will analyze this data using the Pandas DataFrame.

Here, random sets of quesitons are given for which we have to find correct results.

This project is for beginners and for those who want to know how we analyze big data with Python.

 ----

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

In [3]:
df = pd.read_csv("/content/drive/MyDrive/Analysis Projects/Dataset/Project+5+-+London+Housing+Dataset.csv")

In [4]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

In [6]:
df.fillna(0).head(10)

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,0.0
1,2/1/1995,city of london,82203,E09000001,7.0,0.0
2,3/1/1995,city of london,79121,E09000001,14.0,0.0
3,4/1/1995,city of london,77101,E09000001,7.0,0.0
4,5/1/1995,city of london,84409,E09000001,10.0,0.0
5,6/1/1995,city of london,94901,E09000001,17.0,0.0
6,7/1/1995,city of london,110128,E09000001,13.0,0.0
7,8/1/1995,city of london,112329,E09000001,14.0,0.0
8,9/1/1995,city of london,104473,E09000001,17.0,0.0
9,10/1/1995,city of london,108038,E09000001,14.0,0.0

-----

### (A) Convert the Datatype of 'Date' column to Date-Time format.

In [7]:
df["date"]=pd.to_datetime(df['date'])

In [8]:
df.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

### (B.1) Add a new column ''year'' in the dataframe, which contains years only.

In [9]:
df["year"]=df.date.dt.year

In [10]:
df.head()

,date,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1995

### (B.2) Add a new column ''month'' as 2nd column in the dataframe, which contains month only.

In [11]:
df.insert(1,"month",df.date.dt.month)

In [12]:
df.head()

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,3,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,4,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,5,city of london,84409,E09000001,10.0,NaN,1995

### (C) Remove the columns 'year' and 'month' from the dataframe.

In [13]:
df.drop(["year","month"],axis=1).head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN

### (D) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

In [14]:
df[df.no_of_crimes==0].shape[0]

104

### (E) What is the maximum & minimum 'average_price' per year in england ?

In [15]:
df.head(2)

,date,month,area,average_price,code,houses_sold,no_of_crimes,year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995

In [16]:
df1=df[df.area=="england"]
df1.groupby("year")

In [17]:
#max value
df1.average_price.nlargest(1)

13547    250410
Name: average_price, dtype: int64

In [18]:
#min value
df1.average_price.nsmallest(1)

13260    52333
Name: average_price, dtype: int64

### (F) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [19]:
#max
df.groupby("area")['no_of_crimes'].sum().nlargest(1)

area
westminster    1211743.0
Name: no_of_crimes, dtype: float64

In [20]:
#min
df.groupby("area")['no_of_crimes'].sum().nsmallest(1)

area
east midlands    0.0
Name: no_of_crimes, dtype: float64

### (G) Show the total count of records of each area, where average price is less than 100000.

In [21]:
df2=df[df.average_price<100000]
df2.groupby("area")["date"].count()

area
barking and dagenham     85
barnet                   25
bexley                   64
brent                    40
bromley                  33
city of london           11
croydon                  57
ealing                   31
east midlands            96
east of england          76
enfield                  54
england                  87
greenwich                59
hackney                  53
haringey                 33
harrow                   30
havering                 60
hillingdon               44
hounslow                 41
inner london             31
islington                19
kingston upon thames     30
lambeth                  41
lewisham                 62
london                   39
merton                   35
newham                   72
north east              112
north west              111
outer london             46
redbridge                52
south east               59
south west               78
southwark                48
sutton                   54
tower hamlets            47
waltham forest           64
wandsworth               26
west midlands            94
yorks and the humber    110
Name: date, dtype: int64